app/views/recipes/public_recipes.html.erb

SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 2]]
SELECT COUNT("recipe_foods"."id") FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 2]]
---
      <div>
        <p>Total food Items: <%= recipe.recipe_food.count(:id) %></p>
        <p>
          Total Price: $ <%= recipe.recipe_food.sum { |item| item.food.price *