app/views/recipes/show.html.erb

  <tbody>
    <% @recipe.recipe_food.each do |recipe| %>
---
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 1]]