app/controllers/foods_controller.rb

SELECT "foods".* FROM "foods"
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 1], ["id", 2]]
---
  def index
    @foods = Food.all.includes([:user])

INSERT INTO "foods" ("name", "measurement_unit", "price", "quantity", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "sugar"], ["measurement_unit", "1 tsp"], ["price", 2], ["quantity", nil], ["created_at", "2022-10-14 12:38:27.113410"], ["updated_at", "2022-10-14 12:38:27.113410"], ["user_id", 2]]
---
  def create
    @food = current_user.foods.new(food_params)
    respond_to do |format|
      format.html do
        if @food.save

SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1 AND "foods"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 8], ["LIMIT", 1]]
DELETE FROM "foods" WHERE "foods"."id" = $1  [["id", 8]]
---
  def destroy
    @food = current_user.foods.find(params[:id])
    @food.destroy