app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1 ORDER BY "recipes"."id" ASC  [["user_id", 1]]
---
  def index
    # @user = User.includes(:recipes).find(params[:id])
    # @recipes = Recipe.all
    @recipes = current_user.recipes.order(:id)

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def show
    @recipe = Recipe.find(params[:id])

INSERT INTO "recipes" ("name", "description", "preparation_time", "cooking_time", "user_id", "public", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @recipe = current_user.recipes.new(recipe_params)
    respond_to do |format|
      format.html do
        if @recipe.save

SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1 AND "recipes"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 17], ["LIMIT", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 17]]
---
  def destroy
    @recipe = current_user.recipes.find(params[:id])
    @recipe.destroy

SELECT "recipes".* FROM "recipes" WHERE "recipes"."public" = $1  [["public", true]]
---
  def public_recipes
    @recipes = Recipe.where(public: 't')