app/controllers/recipe_foods_controller.rb

  def new
    @foods = current_user.foods
    @food_items = []
    @foods.each do |food|
      @food_items << [food.name, food.id]
    end
    @recipe = current_user.recipes.find(params[:recipe_id])
---
SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1  [["user_id", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1 AND "recipes"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 7], ["LIMIT", 1]]

  def show
    @recipe_food = RecipeFood.find(params[:id])
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def create
    @recipe_food = RecipeFood.new(recipe_food_params)
    respond_to do |format|
      format.html do
        if @recipe_food.save
---
INSERT INTO "recipe_foods" ("quantity", "recipe_id", "food_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["quantity", 1], ["recipe_id", 7], ["food_id", 5], ["created_at", "2022-10-13 21:16:48.803288"], ["updated_at", "2022-10-13 21:16:48.803288"]]

   def destroy
    @recipe_food = RecipeFood.find(params[:id])
    recipe_id = @recipe_food.recipe_id
    @recipe_food.destroy
---
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "recipe_foods" WHERE "recipe_foods"."id" = $1  [["id", 10]]